---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.HandRailType
source: html/127f9ff8-5d1f-4ff3-fdfd-ab0c2902dc2f.htm
---
# HandRailType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.